Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Yusuf Ali.tmx
Source language: ar
Languages: en

source: اصلوها اليوم بما كنتم تكفرون
en: "Embrace ye the (fire) this Day, for that ye (persistently) rejected (Truth)."

source: اليوم نختم على أفواههم وتكلمنا أيديهم وتشهد أرجلهم بما كانوا يكسبون
en: That Day shall We set a seal on their mouths. But their hands will speak to us, and their feet bear witness, to all that they did.

source: ولو نشاء لطمسنا على أعينهم فاستبقوا الصراط فأنى يبصرون
en: If it had been our Will, We could surely have blotted out their eyes; then should they have run about groping for the Path, but how could they have seen?

source: ولو نشاء لمسخناهم على مكانتهم فما استطاعوا مضيا ولا يرجعون
en: And if it had been Our Will, We could have transformed them (to remain) in their places; then should they have been unable to move about, nor could they have returned (after error).

source: ومن نعمره ننكسه في الخلق أفلا يعقلون
en: If We grant long life to any, We cause him to be reversed in nature: Will they not then understand?

source: وما علمناه الشعر وما ينبغي له إن هو إلا ذكر وقرآن مبين
en: We have not instructed the (Prophet) in Poetry, nor is it meet for him: this is no less than a Message and a Qur'an making things clear:

source: لينذر من كان حيا ويحق القول على الكافرين
en: That it may give admonition to any (who are) alive, and that the charge may be proved against those who reject (Truth).

source: أولم يروا أنا خلقنا لهم مما عملت أيدينا أنعاما فهم لها مالكون
en: See they not that it is We Who have created for them - among the things which Our hands have fashioned - cattle, which are under their dominion?-

source: وذللناها لهم فمنها ركوبهم ومنها يأكلون
en: And that We have subjected them to their (use)? of them some do carry them and some they eat:

source: ولهم فيها منافع ومشارب أفلا يشكرون
en: And they have (other) profits from them (besides), and they get (milk) to drink. Will they not then be grateful?

source: واتخذوا من دون الله آلهة لعلهم ينصرون
en: Yet they take (for worship) gods other than Allah, (hoping) that they might be helped!

source: لا يستطيعون نصرهم وهم لهم جند محضرون
en: They have not the power to help them: but they will be brought up (before Our Judgment-seat) as a troop (to be condemned).

source: فلا يحزنك قولهم إنا نعلم ما يسرون وما يعلنون
en: Let not their speech, then, grieve thee. Verily We know what they hide as well as what they disclose.

source: أولم ير الإنسان أنا خلقناه من نطفة فإذا هو خصيم مبين
en: Doth not man see that it is We Who created him from sperm? yet behold! he (stands forth) as an open adversary!

source: وضرب لنا مثلا ونسي خلقه قال من يحيي العظام وهي رميم
en: And he makes comparisons for Us, and forgets his own (origin and) Creation: He says, "Who can give life to (dry) bones and decomposed ones (at that)?"

source: قل يحييها الذي أنشأها أول مرة وهو بكل خلق عليم
en: Say, "He will give them life Who created them for the first time! for He is Well-versed in every kind of creation!-

source: الذي جعل لكم من الشجر الأخضر نارا فإذا أنتم منه توقدون
en: "The same Who produces for you fire out of the green tree, when behold! ye kindle therewith (your own fires)!

source: أوليس الذي خلق السماوات والأرض بقادر على أن يخلق مثلهم بلى وهو الخلاق العليم
en: "Is not He Who created the heavens and the earth able to create the like thereof?" - Yea, indeed! for He is the Creator Supreme, of skill and knowledge (infinite)!

source: إنما أمره إذا أراد شيئا أن يقول له كن فيكون
en: Verily, when He intends a thing, His Command is, "be", and it is!

source: فسبحان الذي بيده ملكوت كل شيء وإليه ترجعون
en: So glory to Him in Whose hands is the dominion of all things: and to Him will ye be all brought back.

source: والصافات صفا
en: By those who range themselves in ranks,

source: فالزاجرات زجرا
en: And so are strong in repelling (evil),

source: فالتاليات ذكرا
en: And thus proclaim the Message (of Allah)!

source: إن إلهكم لواحد
en: Verily, verily, your Allah is one!-

source: رب السماوات والأرض وما بينهما ورب المشارق
en: Lord of the heavens and of the earth and all between them, and Lord of every point at the rising of the sun!

source: إنا زينا السماء الدنيا بزينة الكواكب
en: We have indeed decked the lower heaven with beauty (in) the stars,-

source: وحفظا من كل شيطان مارد
en: (For beauty) and for guard against all obstinate rebellious evil spirits,

source: لا يسمعون إلى الملإ الأعلى ويقذفون من كل جانب
en: (So) they should not strain their ears in the direction of the Exalted Assembly but be cast away from every side,

source: دحورا ولهم عذاب واصب
en: Repulsed, for they are under a perpetual penalty,

source: إلا من خطف الخطفة فأتبعه شهاب ثاقب
en: Except such as snatch away something by stealth, and they are pursued by a flaming fire, of piercing brightness.

source: فاستفتهم أهم أشد خلقا أم من خلقنا إنا خلقناهم من طين لازب
en: Just ask their opinion: are they the more difficult to create, or the (other) beings We have created? Them have We created out of a sticky clay!

source: بل عجبت ويسخرون
en: Truly dost thou marvel, while they ridicule,

source: وإذا ذكروا لا يذكرون
en: And, when they are admonished, pay no heed,-

source: وإذا رأوا آية يستسخرون
en: And, when they see a Sign, turn it to mockery,

source: وقالوا إن هذا إلا سحر مبين
en: And say, "This is nothing but evident sorcery!

source: أإذا متنا وكنا ترابا وعظاما أإنا لمبعوثون
en: "What! when we die, and become dust and bones, shall we (then) be raised up (again)

source: أوآباؤنا الأولون
en: "And also our fathers of old?"

source: قل نعم وأنتم داخرون
en: Say thou: "Yea, and ye shall then be humiliated (on account of your evil)."

source: فإنما هي زجرة واحدة فإذا هم ينظرون
en: Then it will be a single (compelling) cry; and behold, they will begin to see!

source: وقالوا يا ويلنا هذا يوم الدين
en: They will say, "Ah! Woe to us! This is the Day of Judgment!"

source: هذا يوم الفصل الذي كنتم به تكذبون
en: (A voice will say,) "This is the Day of Sorting Out, whose truth ye (once) denied!"

source: احشروا الذين ظلموا وأزواجهم وما كانوا يعبدون
en: "Bring ye up", it shall be said, "The wrong-doers and their wives, and the things they worshipped-

source: من دون الله فاهدوهم إلى صراط الجحيم
en: "Besides Allah, and lead them to the Way to the (Fierce) Fire!

source: وقفوهم إنهم مسئولون
en: "But stop them, for they must be asked:

source: ما لكم لا تناصرون
en: "'What is the matter with you that ye help not each other?'"

source: بل هم اليوم مستسلمون
en: Nay, but that day they shall submit (to Judgment);

source: وأقبل بعضهم على بعض يتساءلون
en: And they will turn to one another, and question one another.

source: قالوا إنكم كنتم تأتوننا عن اليمين
en: They will say: "It was ye who used to come to us from the right hand (of power and authority)!"

source: قالوا بل لم تكونوا مؤمنين
en: They will reply: "Nay, ye yourselves had no Faith!

source: وما كان لنا عليكم من سلطان بل كنتم قوما طاغين
en: "Nor had we any authority over you. Nay, it was ye who were a people in obstinate rebellion!

source: فحق علينا قول ربنا إنا لذائقون
en: "So now has been proved true, against us, the word of our Lord that we shall indeed (have to) taste (the punishment of our sins).

source: فأغويناكم إنا كنا غاوين
en: "We led you astray: for truly we were ourselves astray."

source: فإنهم يومئذ في العذاب مشتركون
en: Truly, that Day, they will (all) share in the Penalty.

source: إنا كذلك نفعل بالمجرمين
en: Verily that is how We shall deal with Sinners.

source: إنهم كانوا إذا قيل لهم لا إله إلا الله يستكبرون
en: For they, when they were told that there is no god except Allah, would puff themselves up with Pride,

source: ويقولون أئنا لتاركو آلهتنا لشاعر مجنون
en: And say: "What! shall we give up our gods for the sake of a Poet possessed?"

source: بل جاء بالحق وصدق المرسلين
en: Nay! he has come with the (very) Truth, and he confirms (the Message of) the messengers (before him).

source: إنكم لذائقو العذاب الأليم
en: Ye shall indeed taste of the Grievous Penalty;-

source: وما تجزون إلا ما كنتم تعملون
en: But it will be no more than the retribution of (the Evil) that ye have wrought;-

source: إلا عباد الله المخلصين
en: But the sincere (and devoted) Servants of Allah,-

source: أولئك لهم رزق معلوم
en: For them is a Sustenance determined,

source: فواكه وهم مكرمون
en: Fruits (Delights); and they (shall enjoy) honour and dignity,

source: في جنات النعيم
en: In Gardens of Felicity,

source: على سرر متقابلين
en: Facing each other on Thrones (of Dignity):

source: يطاف عليهم بكأس من معين
en: Round will be passed to them a Cup from a clear-flowing fountain,

source: بيضاء لذة للشاربين
en: Crystal-white, of a taste delicious to those who drink (thereof),

source: لا فيها غول ولا هم عنها ينزفون
en: Free from headiness; nor will they suffer intoxication therefrom.

source: وعندهم قاصرات الطرف عين
en: And besides them will be chaste women, restraining their glances, with big eyes (of wonder and beauty).

source: كأنهن بيض مكنون
en: As if they were (delicate) eggs closely guarded.

source: فأقبل بعضهم على بعض يتساءلون
en: Then they will turn to one another and question one another.

source: قال قائل منهم إني كان لي قرين
en: One of them will start the talk and say: "I had an intimate companion (on the earth),

source: يقول أإنك لمن المصدقين
en: "Who used to say, 'what! art thou amongst those who bear witness to the Truth (of the Message)?

source: أإذا متنا وكنا ترابا وعظاما أإنا لمدينون
en: "'When we die and become dust and bones, shall we indeed receive rewards and punishments?'"

source: قال هل أنتم مطلعون
en: (A voice) said: "Would ye like to look down?"

source: فاطلع فرآه في سواء الجحيم
en: He looked down and saw him in the midst of the Fire.

source: قال تالله إن كدت لتردين
en: He said: "By Allah! thou wast little short of bringing me to perdition!

source: ولولا نعمة ربي لكنت من المحضرين
en: "Had it not been for the Grace of my Lord, I should certainly have been among those brought (there)!

source: أفما نحن بميتين
en: "Is it (the case) that we shall not die,

source: إلا موتتنا الأولى وما نحن بمعذبين
en: "Except our first death, and that we shall not be punished?"

source: إن هذا لهو الفوز العظيم
en: Verily this is the supreme achievement!

source: لمثل هذا فليعمل العاملون
en: For the like of this let all strive, who wish to strive.

source: أذلك خير نزلا أم شجرة الزقوم
en: Is that the better entertainment or the Tree of Zaqqum?

source: إنا جعلناها فتنة للظالمين
en: For We have truly made it (as) a trial for the wrong-doers.

source: إنها شجرة تخرج في أصل الجحيم
en: For it is a tree that springs out of the bottom of Hell-Fire:

source: طلعها كأنه رءوس الشياطين
en: The shoots of its fruit-stalks are like the heads of devils:

source: فإنهم لآكلون منها فمالئون منها البطون
en: Truly they will eat thereof and fill their bellies therewith.

source: ثم إن لهم عليها لشوبا من حميم
en: Then on top of that they will be given a mixture made of boiling water.

source: ثم إن مرجعهم لإلى الجحيم
en: Then shall their return be to the (Blazing) Fire.

source: إنهم ألفوا آباءهم ضالين
en: Truly they found their fathers on the wrong Path;

source: فهم على آثارهم يهرعون
en: So they (too) were rushed down on their footsteps!

source: ولقد ضل قبلهم أكثر الأولين
en: And truly before them, many of the ancients went astray;-

source: ولقد أرسلنا فيهم منذرين
en: But We sent aforetime, among them, (messengers) to admonish them;-

source: فانظر كيف كان عاقبة المنذرين
en: Then see what was the end of those who were admonished (but heeded not),-

source: ولقد نادانا نوح فلنعم المجيبون
en: (In the days of old), Noah cried to Us, and We are the best to hear prayer.

source: ونجيناه وأهله من الكرب العظيم
en: And We delivered him and his people from the Great Calamity,

source: وجعلنا ذريته هم الباقين
en: And made his progeny to endure (on this earth);

source: وتركنا عليه في الآخرين
en: And We left (this blessing) for him among generations to come in later times:

source: سلام على نوح في العالمين
en: "Peace and salutation to Noah among the nations!"

source: إنا كذلك نجزي المحسنين
en: Thus indeed do we reward those who do right.

source: إنه من عبادنا المؤمنين
en: For he was one of our believing Servants.

source: وإن من شيعته لإبراهيم
en: Verily among those who followed his Way was Abraham.

source: إذ جاء ربه بقلب سليم
en: Behold! he approached his Lord with a sound heart.

source: إذ قال لأبيه وقومه ماذا تعبدون
en: Behold! he said to his father and to his people, "What is that which ye worship?

source: أئفكا آلهة دون الله تريدون
en: "Is it a falsehood- gods other than Allah- that ye desire?

source: فما ظنكم برب العالمين
en: "Then what is your idea about the Lord of the worlds?"

source: فنظر نظرة في النجوم
en: Then did he cast a glance at the Stars.

source: فقال إني سقيم
en: And he said, "I am indeed sick (at heart)!"

source: فتولوا عنه مدبرين
en: So they turned away from him, and departed.

source: فراغ إلى آلهتهم فقال ألا تأكلون
en: Then did he turn to their gods and said, "will ye not eat (of the offerings before you)?...

source: ما لكم لا تنطقون
en: "What is the matter with you that ye speak not (intelligently)?"

source: فراغ عليهم ضربا باليمين
en: Then did he turn upon them, striking (them) with the right hand.

source: فأقبلوا إليه يزفون
en: Then came (the worshippers) with hurried steps, and faced (him).

source: قال أتعبدون ما تنحتون
en: He said: "Worship ye that which ye have (yourselves) carved?

source: والله خلقكم وما تعملون
en: "But Allah has created you and your handwork!"

source: قالوا ابنوا له بنيانا فألقوه في الجحيم
en: They said, "Build him a furnace, and throw him into the blazing fire!"

source: فأرادوا به كيدا فجعلناهم الأسفلين
en: (This failing), they then sought a stratagem against him, but We made them the ones most humiliated!

source: وقال إني ذاهب إلى ربي سيهدين
en: He said: "I will go to my Lord! He will surely guide me!

source: رب هب لي من الصالحين
en: "O my Lord! Grant me a righteous (son)!"

source: فبشرناه بغلام حليم
en: So We gave him the good news of a boy ready to suffer and forbear.

source: فلما بلغ معه السعي قال يا بني إني أرى في المنام أني أذبحك فانظر ماذا ترى قال يا أبت افعل ما تؤمر ستجدني إن شاء الله من الصابرين
en: Then, when (the son) reached (the age of) (serious) work with him, he said: "O my son! I see in vision that I offer thee in sacrifice: Now see what is thy view!" (The son) said: "O my father! Do as thou art commanded: thou will find me, if Allah so wills one practising Patience and Constancy!"

source: فلما أسلما وتله للجبين
en: So when they had both submitted their wills (to Allah), and he had laid him prostrate on his forehead (for sacrifice),

source: وناديناه أن يا إبراهيم
en: We called out to him "O Abraham!

source: قد صدقت الرؤيا إنا كذلك نجزي المحسنين
en: "Thou hast already fulfilled the vision!" - thus indeed do We reward those who do right.

source: إن هذا لهو البلاء المبين
en: For this was obviously a trial-

source: وفديناه بذبح عظيم
en: And We ransomed him with a momentous sacrifice:

source: سلام على إبراهيم
en: "Peace and salutation to Abraham!"

source: كذلك نجزي المحسنين
en: Thus indeed do We reward those who do right.

source: وبشرناه بإسحاق نبيا من الصالحين
en: And We gave him the good news of Isaac - a prophet,- one of the Righteous.

source: وباركنا عليه وعلى إسحاق ومن ذريتهما محسن وظالم لنفسه مبين
en: We blessed him and Isaac: but of their progeny are (some) that do right, and (some) that obviously do wrong, to their own souls.

source: ولقد مننا على موسى وهارون
en: Again (of old) We bestowed Our favour on Moses and Aaron,

source: ونجيناهما وقومهما من الكرب العظيم
en: And We delivered them and their people from (their) Great Calamity;

source: ونصرناهم فكانوا هم الغالبين
en: And We helped them, so they overcame (their troubles);

source: وآتيناهما الكتاب المستبين
en: And We gave them the Book which helps to make things clear;

source: وهديناهما الصراط المستقيم
en: And We guided them to the Straight Way.

source: وتركنا عليهما في الآخرين
en: And We left (this blessing) for them among generations (to come) in later times:

source: سلام على موسى وهارون
en: "Peace and salutation to Moses and Aaron!"

source: إنهما من عبادنا المؤمنين
en: For they were two of our believing Servants.

source: وإن إلياس لمن المرسلين
en: So also was Elias among those sent (by Us).

source: إذ قال لقومه ألا تتقون
en: Behold, he said to his people, "Will ye not fear (Allah)?

source: أتدعون بعلا وتذرون أحسن الخالقين
en: "Will ye call upon Baal and forsake the Best of Creators,-

source: الله ربكم ورب آبائكم الأولين
en: "Allah, your Lord and Cherisher and the Lord and Cherisher of your fathers of old?"

source: فكذبوه فإنهم لمحضرون
en: But they rejected him, and they will certainly be called up (for punishment),-

source: سلام على إل ياسين
en: "Peace and salutation to such as Elias!"

source: وإن لوطا لمن المرسلين
en: So also was Lut among those sent (by Us).

source: إذ نجيناه وأهله أجمعين
en: Behold, We delivered him and his adherents, all

source: وإنكم لتمرون عليهم مصبحين
en: Verily, ye pass by their (sites), by day-

source: وبالليل أفلا تعقلون
en: And by night: will ye not understand?

source: وإن يونس لمن المرسلين
en: So also was Jonah among those sent (by Us).

source: إذ أبق إلى الفلك المشحون
en: When he ran away (like a slave from captivity) to the ship (fully) laden,

source: فساهم فكان من المدحضين
en: He (agreed to) cast lots, and he was condemned:

source: فالتقمه الحوت وهو مليم
en: Then the big Fish did swallow him, and he had done acts worthy of blame.

source: فلولا أنه كان من المسبحين
en: Had it not been that he (repented and) glorified Allah,

source: للبث في بطنه إلى يوم يبعثون
en: He would certainly have remained inside the Fish till the Day of Resurrection.

source: فنبذناه بالعراء وهو سقيم
en: But We cast him forth on the naked shore in a state of sickness,

source: وأنبتنا عليه شجرة من يقطين
en: And We caused to grow, over him, a spreading plant of the gourd kind.

source: وأرسلناه إلى مائة ألف أو يزيدون
en: And We sent him (on a mission) to a hundred thousand (men) or more.

source: فآمنوا فمتعناهم إلى حين
en: And they believed; so We permitted them to enjoy (their life) for a while.

source: فاستفتهم ألربك البنات ولهم البنون
en: Now ask them their opinion: Is it that thy Lord has (only) daughters, and they have sons?-

source: أم خلقنا الملائكة إناثا وهم شاهدون
en: Or that We created the angels female, and they are witnesses (thereto)?

source: ألا إنهم من إفكهم ليقولون
en: Is it not that they say, from their own invention,

source: ولد الله وإنهم لكاذبون
en: "Allah has begotten children"? but they are liars!

source: أصطفى البنات على البنين
en: Did He (then) choose daughters rather than sons?

source: ما لكم كيف تحكمون
en: What is the matter with you? How judge ye?

source: أفلا تذكرون
en: Will ye not then receive admonition?

source: أم لكم سلطان مبين
en: Or have ye an authority manifest?

source: فأتوا بكتابكم إن كنتم صادقين
en: Then bring ye your Book (of authority) if ye be truthful!

source: وجعلوا بينه وبين الجنة نسبا ولقد علمت الجنة إنهم لمحضرون
en: And they have invented a blood-relationship between Him and the Jinns: but the Jinns know (quite well) that they have indeed to appear (before his Judgment-Seat)!

source: سبحان الله عما يصفون
en: Glory to Allah! (He is free) from the things they ascribe (to Him)!

source: فإنكم وما تعبدون
en: For, verily, neither ye nor those ye worship-

source: ما أنتم عليه بفاتنين
en: Can lead (any) into temptation concerning Allah,

source: إلا من هو صال الجحيم
en: Except such as are (themselves) going to the blazing Fire!

source: وما منا إلا له مقام معلوم
en: (Those ranged in ranks say): "Not one of us but has a place appointed;

source: وإنا لنحن الصافون
en: "And we are verily ranged in ranks (for service);

source: وإنا لنحن المسبحون
en: "And we are verily those who declare (Allah's) glory!"

source: وإن كانوا ليقولون
en: And there were those who said,

source: لو أن عندنا ذكرا من الأولين
en: "If only we had had before us a Message from those of old,

source: لكنا عباد الله المخلصين
en: "We should certainly have been Servants of Allah, sincere (and devoted)!"

source: فكفروا به فسوف يعلمون
en: But (now that the Qur'an has come), they reject it: But soon will they know!

source: ولقد سبقت كلمتنا لعبادنا المرسلين
en: Already has Our Word been passed before (this) to our Servants sent (by Us),

source: إنهم لهم المنصورون
en: That they would certainly be assisted,

source: وإن جندنا لهم الغالبون
en: And that Our forces,- they surely must conquer.

source: فتول عنهم حتى حين
en: So turn thou away from them for a little while,

source: وأبصرهم فسوف يبصرون
en: And watch them (how they fare), and they soon shall see (how thou farest)!

source: فإذا نزل بساحتهم فساء صباح المنذرين
en: But when it descends into the open space before them, evil will be the morning for those who were warned (and heeded not)!

source: وتول عنهم حتى حين
en: So turn thou away from them for a little while,

source: وأبصر فسوف يبصرون
en: And watch (how they fare) and they soon shall see (how thou farest)!

source: سبحان ربك رب العزة عما يصفون
en: Glory to thy Lord, the Lord of Honour and Power! (He is free) from what they ascribe (to Him)!

source: وسلام على المرسلين
en: And Peace on the messengers!

source: والحمد لله رب العالمين
en: And Praise to Allah, the Lord and Cherisher of the Worlds.

source: ص والقرآن ذي الذكر
en: Sad: By the Qur'an, Full of Admonition: (This is the Truth).

source: بل الذين كفروا في عزة وشقاق
en: But the Unbelievers (are steeped) in self-glory and Separatism.

source: كم أهلكنا من قبلهم من قرن فنادوا ولات حين مناص
en: How many generations before them did We destroy? In the end they cried (for mercy)- when there was no longer time for being saved!

source: وعجبوا أن جاءهم منذر منهم وقال الكافرون هذا ساحر كذاب
en: So they wonder that a Warner has come to them from among themselves! and the Unbelievers say, "This is a sorcerer telling lies!

source: أجعل الآلهة إلها واحدا إن هذا لشيء عجاب
en: "Has he made the gods (all) into one Allah? Truly this is a wonderful thing!"

source: وانطلق الملأ منهم أن امشوا واصبروا على آلهتكم إن هذا لشيء يراد
en: And the leader among them go away (impatiently), (saying), "Walk ye away, and remain constant to your gods! For this is truly a thing designed (against you)!

source: ما سمعنا بهذا في الملة الآخرة إن هذا إلا اختلاق
en: "We never heard (the like) of this among the people of these latter days: this is nothing but a made-up tale!"

source: أأنزل عليه الذكر من بيننا بل هم في شك من ذكري بل لما يذوقوا عذاب
en: "What! has the Message been sent to him - (Of all persons) among us?"... but they are in doubt concerning My (Own) Message! Nay, they have not yet tasted My Punishment!

source: أم عندهم خزائن رحمة ربك العزيز الوهاب
en: Or have they the treasures of the mercy of thy Lord,- the Exalted in Power, the Grantor of Bounties without measure?

source: أم لهم ملك السماوات والأرض وما بينهما فليرتقوا في الأسباب
en: Or have they the dominion of the heavens and the earth and all between? If so, let them mount up with the ropes and means (to reach that end)!

source: جند ما هنالك مهزوم من الأحزاب
en: But there - will be put to flight even a host of confederates.

source: كذبت قبلهم قوم نوح وعاد وفرعون ذو الأوتاد
en: Before them (were many who) rejected messengers,- the people of Noah, and 'Ad, and Pharaoh, the Lord of Stakes,

source: وثمود وقوم لوط وأصحاب الأيكة أولئك الأحزاب
en: And Thamud, and the people of Lut, and the Companions of the Wood; - such were the Confederates.

source: إن كل إلا كذب الرسل فحق عقاب
en: Not one (of them) but rejected the messengers, but My punishment came justly and inevitably (on them).

source: وما ينظر هؤلاء إلا صيحة واحدة ما لها من فواق
en: These (today) only wait for a single mighty Blast, which (when it comes) will brook no delay.

source: وقالوا ربنا عجل لنا قطنا قبل يوم الحساب
en: They say: "Our Lord! hasten to us our sentence (even) before the Day of Account!"
